const transCode = (code) =>{
				let errCode = {
					"10001":'参数无效',
					"10001":'参数为空',
					"10003":'参数类型错误',
					"10004":'参数缺失',
					"10005":'API错误',
					"20001":'用户未登陆',
					"20002":'密码错误',
					"20003":'账号已被禁用',
					"20004":'用户不存在',
					"20005":'用户已存在',
					"20006":'ID错误',
					"20007":'激活码错误',
					"20008":'激活码类型错误',
					"20009":'激活码已使用',
					"20010":'该类型激活码不可用',
					"40001":'系统繁忙，请稍后',
					"50001":'数据未找到',
					"50002":'数据有误',
					"50003":'数据已存在',
					"60001":'内部系统接口调用异常',
					"60002":'外部系统接口调用异常',
					"60003":'接口禁止访问',
					"60004":'接口地址无效',
					"60005":'接口请求超时',
					"60006":'负载过高，请稍后再试',
					"70001":'无访问权限'
					
				};

				if (code in errCode) {
					return errCode[code];
				}else{
					return '错误';
				}
}

export  { transCode }